//Задание №1 - Написать цикл, который выводит через пробел 100 чисел с приставкой "a".

package Module1.Homework2;

public class Task1 {

    public static void main(String[] args) {
        for (int i = 1; i <= 100; i++) {
            System.out.print(i + "a ");
        }
    }
}
